{
  "title": "Business group backs phased approach for EDSA rehabilitation",
  "content": "The Management Association of the Philippines (MAP) is urging the government to maintain the phased implementation of the long-awaited rehabilitation of EDSA while the project is currently suspended.\nMAP, which features the country’s leading business executives, supports the plan to construct the project in phases.\nThe Department of Public Works and Highways (DPWH), the lead agency for the project, had earlier stated that rehabilitation work would first focus on sections of the highway where next year’s Association of Southeast Asian Nations (ASEAN) Summit will take place.\nDPWH Secretary Manuel Bonoan said the department will prioritize both lanes of the Pasay and Guadalupe segment of EDSA until it starts work on other sections.\nThe Philippines will host the ASEAN Summit in 2026. The preparatory meetings, which will start in January, which is expected to drive heavy traffic near the venues.\nPresident Ferdinand “Bongbong” Marcos Jr. has since ordered the postponement of the EDSA rebuild for one month to accommodate a new construction plan.\nTransportation Secretary Vince Dizon said the government is currently working to find a “non-conventional method” to complete the rehabilitation work in six months to one year, instead of the initial one and a half to two years.\nWhile there is no final plan yet, MAP said the phased implementation should stay “for the simple reason that it is long overdue and needed.”\n“In fact, we are glad that EDSA is being given focused attention,” the business group said.\nMAP previously urged the Marcos administration to expedite the completion of a Skyway link project linking North Luzon Expressway-South Luzon Expressway (NLEX-SLEX) Connector Road and Metro Manila Skyway Stage 3.\nThe group said the infrastructure project will enhance connectivity between northern and southern Luzon, significantly reducing travel time.\nIt noted that this would improve operations of various businesses and boost the country’s tourism potential, further advancing economic growth.",
  "images": [
    "Images/business-group-backs-phased-approach-for-edsa-rehabilitation_1.png"
  ],
  "source_url": "https://mb.com.ph/2025/06/03/business-group-backs-phased-approach-for-edsa-rehabilitation"
}